import random

#Задание 1
#b=random.randint(0,10)
#i=0
#while True:
 #   a=int(input ("Введите число от 0 до 10"))
 #   if a<0:
  #      print("Число не должно быть меньше 0")
   # elif a>b:
    #    print("Ваше число больше числа, загаданным компьютером")
     #   i+=1
   # elif a<b:
    #    print("Ваше число меньше числа, загаданного компьютером")
     #   i+=1
  #  elif a==b:
   #     print("Вы угадали число, которое загадал компьютер!!!")
    #    break



#Задание 2
#inputword=str(input("Введите слово"))
#razdel=inputword.split()
#gruppirovka={}
#for simvol in razdel:
#    if simvol in gruppirovka:
#        gruppirovka[simvol].append(simvol)
#    else:
#        gruppirovka[simvol]=[simvol]
#        result=list(gruppirovka.values())      
#print(result)


